---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeAllowedBarTypes
source: html/0c183ff9-8e9a-b183-692c-e99c0cda288c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeAllowedBarTypes Property

"Allowable Rebar Bar Types"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeAllowedBarTypes { get; }
```